Public Member Functions | Protected Member Functions | Static Protected Member Functions | Friends | List of all members
ACAPI::MEP::v1::TransitionDefault Class Reference
MEP Element Manager
The TransitionDefault contains the necessary non-geometric data for creating and modifying a Transition. More...
#include <MEPTransitionDefault.hpp>
 Inheritance diagram for ACAPI::MEP::v1::TransitionDefault:
 Public Member Functions
double  | GetAngle () const
double  | GetOffsetY () const
double  | GetOffsetZ () const
template<class ModifierFunc >
Result< void >  | Modify (ModifierFunc &&modifierFunc)
Executes the given modifier scope in a NotUndoable command.
Result< void >  | SetAngle (double length)
Sets the length of TransitionDefault.
 Public Member Functions inherited from ACAPI::MEP::v1::ElementDefault
std::optional< double >  | GetInsulationThickness () const
uint32_t  | GetPortCount () const
Result< ConnectorShape >  | GetShapeOfPort (uint32_t portIdx) const
Domain  | GetDomain () const
API_Guid  | GetObjectId () const
template<class ModifierFunc >
Result< void >  | Modify (ModifierFunc &&modifierFunc)
Executes the given modifier scope in a NotUndoable command.
 void  | RemoveInsulation ()
Removes the insulation.
Result< void >  | SetInsulationThickness (double insulationThickness)
Sets the thickness of insulation on the ElementDefault.
void  | SetObjectId (const API_Guid &libraryPartId)
Sets the referenced library part of the ElementDefault.
 Protected Member Functions
TransitionDefault (std::shared_ptr< Impl::ITransitionDefaultImpl >)
 Protected Member Functions inherited from ACAPI::MEP::v1::ElementDefault
ElementDefault (std::shared_ptr< Impl::IElementDefaultImpl > impl)
Modifier (ElementDefault &)
 Static Protected Member Functions
 static Result< TransitionDefault >  | Create (const API_Token &, Domain)
 Friends
 class  | RoutingNode
 class  | RoutingNodeDefault
 class  | Transition
Result< TransitionDefault >  | CreateTransitionDefault (Domain)
Creates a TransitionDefault.
Detailed Description
The TransitionDefault contains the necessary non-geometric data for creating and modifying a Transition.
Since
Archicad 27
Example code snippet from Test / New MEP
Take a look at RoutingElementDefault and RoutingNodeDefault
Member Function Documentation
◆ GetAngle()
 double ACAPI::MEP::v1::TransitionDefault::GetAngle  |  ( |   | ) |   const
Returns
Returns the angle of the TransitionDefault in degrees.
◆ GetOffsetY()
 double ACAPI::MEP::v1::TransitionDefault::GetOffsetY  |  ( |   | ) |   const
Returns
Returns the offset of the TransitionDefault in the Y direction.
◆ GetOffsetZ()
 double ACAPI::MEP::v1::TransitionDefault::GetOffsetZ  |  ( |   | ) |   const
Returns
Returns the offset of the TransitionDefault in the Z direction.
◆ Modify()
 template<class ModifierFunc >
 Result< void > ACAPI::MEP::v1::TransitionDefault::Modify  |  ( |  ModifierFunc &&  |  modifierFunc | )
Executes the given modifier scope in a NotUndoable command.
Parameters
modifierFunc | The modifier scope (lambda, std::function or function pointer) the caller wants to execute.
Returns
Returns an error if the process of modification fails for some reason, otherwise nothing.
◆ SetAngle()
 Result< void > ACAPI::MEP::v1::TransitionDefault::SetAngle  |  ( |  double  |  length | )
Sets the length of TransitionDefault.
Parameters
length | The value to be set. Needs to be between [1, 89] degrees.
Returns
Returns an error if the parameter is not in range, otherwise nothing.
Friends And Related Symbol Documentation
◆ CreateTransitionDefault
 Result< TransitionDefault > CreateTransitionDefault  |  ( |  Domain  |  domain | )
friend
Creates a TransitionDefault.
Parameters
domain | The Domain of the requested TransitionDefault.
Returns
If able, returns a copy of Archicad's current Default of the Transition from the Routing tool for the domain defined by the parameter, otherwise Error.